{"classification": ["bill"], "extras": {}, "_id": "583e6486-7b62-11e5-88b5-1040f380f686", "title": "Prohibiting liquor in the 20th Ward", "related_bills": [], "legislative_session": "2014-2015", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-11-21", "description": "reading-1", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 200   \t    INTRODUCED BY ALDERMAN CRAIG SCHMID An ordinance repealing ordinance 69001 and enacting a new ordinance confirming the restrictions set forth in ordinance 69001 on the issuance of any package or drink liquor licenses for any currently non-licensed premises within the boundaries of the Twentieth Ward Liquor Control District, as established herein, for a period of three years from the effective date hereof; containing exceptions allowing, during the period, for the transfer of existing licenses, under certain circumstances; or the issuance of a drink license (no package) to persons operating a restaurant with at least 50% food sales at a previously non-licensed premises; or the issuance of a drink license(no package) to persons operating premises with a Cherokee Street address from the west curbline of Jefferson Avenue to the east curbline of Nebraska Avenue; or to persons who on the effective date of this ordinance operated a bar for at least three (3) years in compliance with excise laws and continue to operate with at least 20% food sales, thereafter; and containing a severability and emergency clause. "}], "identifier": "BB 200", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9591", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Craig N Schmid ", "person_id": "~{\"name\": \"Craig N Schmid \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}