{"classification": ["bill"], "extras": {}, "_id": "0fc22228-7b68-11e5-a3c4-1040f380f686", "title": "S. Grand Great Str. Improvements", "related_bills": [], "legislative_session": "2010-2011", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-04-30", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-05-14", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-05-21", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-05-28", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO.   41          INTRODUCED BY ALDERMAN STEPHEN CONWAY AND ALDERWOMAN JENNIFER FLORIDA    An Ordinance, recommended by the Board of Public Service of the City of St. Louis (the \"Board of Public Service\"), establishing a public works and improvement project for the construction of the South Grand Great Streets Improvements  - Phase Two between Arsenal Street and Utah Street (the \"South Grand Great Streets Improvements - Phase Two\"); and authorizing and directing the City of St. Louis (the \"City\"), by and through its Board of Public Service, to let contracts and provide for the construction, materials, and equipment for the South Grand Great Streets Improvements - Phase Two, authorizing the Board of Public Service to employ labor and consultants, pay salaries, fees and wages, acquire real and personal property (by lease, purchase, or condemnation), and to enter into supplemental agreements with the Missouri Highway and Transportation Commission, Federal Highway Administration, utilities, and other governmental agencies for the South Grand Great Streets Improvements - Phase Two all in accordance with the federal Transportation Equity Act for the 21st Century (23 U.S.C. 110, et seq.), with any contract containing sections for: description of the work, material guarantees, estimated expenditure allocations, fund reversion authorization, applicable federal and state wage rate requirements, equal opportunity provisions, the Mayor's Executive Orders, and contract advertising statutes; requiring that all work provided for herein shall be carried out in accordance with detailed plans and specifications adopted and approved by the Board of Public Service before bids are advertised therefore; directing that all construction contracts let by authority of this Ordinance provide for federal and state prevailing wages requirements including prevailing wage holiday and overtime pay and compliance with all applicable statutes of the State of Missouri, the City Charter and the Revised Code of the City, as amended; requiring all specifications approved by the Board of Public Service and contracts let by authority of this Ordinance provide for compliance with the Mayor's Executive Orders on Equal Opportunity and maximum MBE/WBE/DBE utilization goals, except when superseded or prohibited by federal or state law or regulation; requiring all advertisements for bids pursuant to this Ordinance be subject to the provisions of Section 8.250 RSMo., as amended; and appropriating the total estimated cost of the South Grand Great Streets Improvements - Phase Two of One Million, Two Hundred and Fifty Thousand Dollars ($1,250,000.00) from various sources including the Federal Highway Administration Safe, Accountable, Flexible, Efficient Transportation Equity Act:  A Legacy for Users (SAFETEA-LU), and the One-Half Cent Ward Capital Improvement Fund;  authorizing and directing the Comptroller of the City to draw warrants from time to time and disburse funds appropriated by this ordinance and to receive and disburse grant funds in accordance with the Transportation Equity Act of the 21st Century (23 U.S.C. 110, et seq.) upon the signature and certification of vouchers by the President of the Board of Public Service; and containing a public work emergency clause.  "}], "identifier": "BB 41", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=6119", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Stephen Conway ", "person_id": "~{\"name\": \"Stephen Conway \"}", "entity_type": "person", "organization_id": null, "primary": true}, {"classification": "co-sponsor", "name": "Jennifer Florida", "person_id": "~{\"name\": \"Jennifer Florida\"}", "entity_type": "person", "organization_id": null, "primary": false}], "versions": []}