{"classification": ["bill"], "extras": {}, "_id": "41d226c8-7b63-11e5-b505-1040f380f686", "title": "Public Works project for Vandeventer Corridor", "related_bills": [], "legislative_session": "2013-2014", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-06-21", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-06-28", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-07-03", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-07-12", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 120   INTRODUCED BY:  ALDERMAN JOSEPH RODDY  An Ordinance recommended by the Board of Public Service of the City of St. Louis (the \"Board of Public Service\"), establishing a multi-phased public works and improvement project for the design and construction of various roadway infrastructure and safety improvements including, but not limited to, roadway widening, resurfacing, traffic signal upgrades, pedestrian access modifications, lighting, and aesthetic enhancements, designated herein as the Vandeventer Transportation Corridor Project running north along Vandeventer Avenue from the intersection of I-44 to the intersection of Laclede Avenue (the \"Project\"), and designating herein Phase I of the Project as the area along Vandeventer Avenue between I-64/US40 and Laclede Avenue (\"Phase I\"); and authorizing and directing the City of St. Louis (the \"City\"), by and through its Board of Public Service, to let contracts and provide for the design, construction, materials, and equipment for the Project, authorizing the Board of Public Service to employ labor and consultants, pay salaries, fees and wages, acquire any and all real and personal property rights and interests, in whole or in part, including easements (by lease, purchase, eminent domain, condemnation, or otherwise) as necessary and to enter into supplemental agreements with the Missouri Highway and Transportation Commission, Federal Highway Administration, utilities, other governmental agencies, and third parties, as applicable, for the Project all in accordance with the federal Transportation Equity Act for the 21st Century (23 U.S.C. 110, et. seq.) when applicable, with any contract containing sections for: description of work, material guarantees, estimated expenditure allocations, fund reversion authorization, applicable federal and state wage rate requirements, equal opportunity provisions, the Mayor Executive Orders, and contract advertising statutes; and any other necessary agreements; requiring that all construction work provided for herein shall be carried out in accordance with detailed plans and specifications adopted and approved by the Board of Public Service before bids are advertised therefore; directing that all construction contracts let by authority of this Ordinance provide for federal and state prevailing wage requirements including prevailing wage holiday and overtime pay and compliance with all applicable statutes of the State of Missouri, the City Charter and the Revised Code of the City, as amended; requiring all specifications approved by the Board of Public Service and contracts let by authority of this Ordinance provide for: compliance with the Mayor's Executive Orders on Equal Opportunity and maximum MBE/WBE/DBE utilization goals, except when superseded or prohibited by federal or state law or regulation; contractor's compliance with the provisions of Sections 285.525 thru 285.555 of the Revised Statutes of Missouri, as amended, by requiring enrollment and participation in a federal work authorization program and no knowing employment of unauthorized aliens; contractor's compliance with the provisions of Section 292.675 of the Revised Statutes of Missouri, as amended, by providing a ten-hour Occupational Safety and Health Administration construction safety program for their on-site employees; contractor's compliance with the provisions of Section 34.057 of the Revised Statutes of Missouri, as amended, (Prompt Payment/Retainage), as applicable; requiring all advertisements for bids pursuant to this Ordinance be subject to the provisions of Section 8.250 of the Revised Statutes of Missouri, as amended; and appropriating the total estimated cost of Phase I of the Project in excess of One Million Dollars ($1,000,000.00) from various City sources provided no City funds shall be expended without a source of reimbursement from a third party; authorizing and directing the Comptroller of the City to draw warrants from time to time and disburse funds appropriated by this ordinance and to receive and disburse grant funds, as applicable, in accordance with the Transportation Equity Act of the 21st Century (23 U.S.C. 110, et seq.), as applicable, upon the signature and certification of vouchers by the President of the Board of Public Service; and containing a public work emergency clause.    "}], "identifier": "BB 120", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=8649", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Joseph D. Roddy ", "person_id": "~{\"name\": \"Joseph D. Roddy \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}