{"classification": ["bill"], "extras": {}, "_id": "afd4a4ca-7b63-11e5-961e-1040f380f686", "title": "Redevelopment plan for 1900 Market", "related_bills": [], "legislative_session": "2013-2014", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-09-27", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-10-11", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-10-18", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-10-25", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 189\tINTRODUCED BY ALDERWOMAN CHRISTINE INGRASSIA  \tAn ordinance approving a development plan for the 1900 Market St. Development Area (\"Area\") after finding that the Area is a blighted area as defined in Sections 100.310 (2), (11), (18) of the Revised Statutes of Missouri, as amended, (the \"Statute\" being Sections 100.300 to 100.620 inclusive), containing a description of the boundaries of said Area in the City of St. Louis (\"City\"), attached hereto and incorporated herein as Attachment \"A,\" finding that industrial development and rehabilitation of the Area is in the interest of the public health, safety, morals and general welfare of the people of the City; approving the Blighting Study and Plan dated March 19, 2013, for the Area (\"Plan\"), incorporated herein as Attachment \"B\"; finding that there is a feasible financial plan for the development of the Area which affords maximum opportunity for development of the Area by private enterprise; finding that no property in the Area may be acquired by the Planned Industrial Expansion Authority of the City of St. Louis (\"PIEA\") through the exercise of eminent domain and; finding that the property within the Area is partially occupied and the Developer shall be responsible for providing relocation assistance pursuant to the Plan to eligible occupants displaced as a result of implementation of the Plan; finding that financial aid may be necessary to enable the Area to be redeveloped in accordance with the Plan; finding that there shall be available up to a twenty (20) real estate tax abatement; and pledging cooperation of the St. Louis Board of Aldermen (\"Board\") and requesting various officials, departments, boards and agencies of the City to cooperate and to exercise their respective powers in a manner consistent with the Plan; and containing a severability clause.    "}], "identifier": "BB 189", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=8789", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Christine Ingrassia ", "person_id": "~{\"name\": \"Christine Ingrassia \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}