{"classification": ["bill"], "extras": {}, "_id": "06bb488a-7b63-11e5-aa8a-1040f380f686", "title": "Phase 2 system bridge maintenance", "related_bills": [], "legislative_session": "2013-2014", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-05-31", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-06-14", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-06-21", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-06-28", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 76     INTRODUCED BY ALDERMAN FREEMAN BOSLEY, SR.    An Ordinance, recommended by the Board of Public Service of the City of St. Louis (the \"Board of Public Service\"), establishing a public works and improvement project for the design and construction of various preventive maintenance procedures on eight (8) \"Off-System\" bridges including Gravois Underpass (Bridge ID No. 400.10), Chippewa Underpass (Bridge ID No. 400.09), Laurel and Waterman Over MetroLink (Bridge ID No. 250.08), Morganford Over Union Pacific Railroad (Bridge ID No. 230.071), Alabama Over River Des Peres (Bridge ID No. 100.011), Knox Over River Des Peres (Bridge ID No. 100.070), Sulphur Over River Des Peres (Bridge ID No. 100.120), and Sublette Over River Des Peres (Bridge ID No. 100.111), all of which are bridges located on local roads or \"Non Federal-Aid\" routes (the \"Off-System Bridge Maintenance Project - Phase Two\"); authorizing and directing the City of St. Louis (the \"City\"), by and through its Board of Public Service, to exchange City Bridge Rehabilitation and Replacement Program (\"BRO\") funds for Soft Credit Match Funds from another Missouri County, and to let contracts and provide for the design, construction, materials, and equipment for the Off-System Bridge Maintenance Project - Phase Two; authorizing the Board of Public Service to employ labor and consultants, pay salaries, fees and wages, acquire any and all said real and personal property rights and interests, in whole or in part, including easements (by lease, purchase, eminent domain, condemnation, or otherwise), as necessary for completion of the Off-System Bridge Maintenance Project - Phase Two, and to enter into supplemental agreements with the Missouri Highway and Transportation Commission, Federal Highway Administration, utilities, railroads, and other governmental agencies as necessary for completion of the Off-System Bridge Maintenance Project - Phase Two, all in accordance with the federal Transportation Equity Act for the 21st Century (23 U.S.C. § 110, et seq.), these agreements may include, but are not limited to, sections for: description of the work, material guarantees, estimated expenditure allocations, fund reversion authorization, applicable federal and state wage rate requirements, equal opportunity provisions, the Mayor's Executive Orders, and contract advertising statutes; requiring that all work provided for herein shall be carried out in accordance with detailed plans and specifications adopted and approved by the Board of Public Service before bids are advertised therefor; directing that all construction contracts let by authority of this Ordinance provide for federal and state prevailing wage requirements, including prevailing wage holiday and overtime pay, and compliance with all applicable statutes of the State of Missouri (Sections 290.210 through 290.340 of the Revised Statutes of Missouri 2000, as amended), the City Charter, City ordinances, and the Revised Code of the City, as amended; requiring all specifications approved by the Board of Public Service and contracts let by authority of this Ordinance shall provide for: compliance with the Mayor's Executive Orders on Equal Opportunity and maximum MBE/WBE/DBE utilization goals, except when superseded or prohibited by federal or state law or regulation; requiring that all contractor's shall comply with the provisions of Sections 285.525 through 285.555 of the Revised Statutes of Missouri 2000, as amended, by requiring enrollment and participation in a federal work authorization program and agreeing not to knowingly employ unauthorized aliens; requiring that all contractor's shall comply with the provisions of Section 292.675 of the Revised Statutes of Missouri 2000, as amended, by providing a ten-hour Occupational Safety and Health Administration construction safety program for their on-site employees; requiring that all contractor's shall comply with the provisions of Section 34.057 of the Revised Statutes of Missouri 2000, as amended, (Prompt Payment/Retainage), as applicable; requiring the furnishing of a bond by every contractor on this public works project pursuant to the provisions of Section 107.170 of the Revised Statutes of Missouri 2000, as amended; requiring compliance with Section 34.353 of the Revised Statutes of Missouri 2000, as amended (Domestic Product Procurement Act - Buy American); requiring all advertisements for bids pursuant to this Ordinance be subject to the provisions of Section 8.250 of the Revised Statutes of Missouri 2000, as amended; appropriating the total estimated cost of the Off-System Bridge Maintenance Project - Phase Two of Eight Hundred Fifty Thousand Dollars ($850,000.00) from various sources including the Off-System BRO funds, and Soft Match Credit Funds obtained from another Missouri County in exchange for City BRO Funds;  authorizing and directing the Comptroller of the City to draw warrants from time to time and disburse funds appropriated by this Ordinance and to receive and disburse grant funds in accordance with the Transportation Equity Act of the 21st Century (23 U.S.C. § 110, et seq.) upon the signature and certification of vouchers by the President of the Board of Public Service; and containing a public work emergency clause.      "}], "identifier": "BB 76", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=8564", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Freeman M. Bosley Sr. ", "person_id": "~{\"name\": \"Freeman M. Bosley Sr. \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}