{"classification": ["bill"], "extras": {}, "_id": "f8ae61ec-7b63-11e5-a5a7-1040f380f686", "title": "City Parks Leasehold Improvement Bonds", "related_bills": [], "legislative_session": "2013-2014", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-11-15", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-12-06", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-12-13", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-01-10", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL #236\tINTRODUCED BY ALDERMAN KENNEDY, PRESIDENT LEWIS REED  An Ordinance recommended by the Board of Estimate and Apportionment authorizing and directing the St. Louis Municipal Finance Corporation (the \"Corporation\") to issue and sell the Corporation's City Parks Leasehold Improvement Dedicated Revenue Bonds (City of St. Louis, Missouri, Lessee), Series 2013, in an aggregate principal amount not to exceed $26,000,000 (the \"Series 2013 Bonds\") in order to fund all or a portion of the planting of trees and other landscape materials in the rights of way of, and the design, construction, renovation, equipping, and installation of long-lasting, essential capital improvements to, certain City Parks (as defined herein), as provided herein, all for the general welfare, safety and benefit of the citizens of The City of St. Louis, Missouri (the \"City\"); authorizing and directing the Corporation to execute and deliver the Indenture, the Base Lease, the Lease Purchase Agreement, the Tax Compliance Agreement, the Official Statement, the Bond Purchase Agreement, and the Credit Agreement, if any (all as defined herein); authorizing the City to execute the Base Lease, the Lease Purchase Agreement, the Continuing Disclosure Agreement, the Tax Compliance Agreement, the Official Statement, the Bond Purchase Agreement, and the Credit Agreement, if any (all as defined herein); authorizing the Corporation to obtain credit enhancement for the Series 2013 Bonds from a Credit Provider (as defined herein) authorizing the payment of any obligations due to a Credit Provider, if any, and authorizing the Mayor, the Comptroller, and any other appropriate City officials to execute the Credit Agreement and other documents related thereto, if any; authorizing participation of appropriate City officials in preparing the Official Statement; authorizing the acceptance of the terms of the Bond Purchase Agreement and the taking of further actions with respect thereto; authorizing the payment of certain costs of issuance of the Series 2013 Bonds; authorizing and directing the taking of other actions and approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof; superseding provisions of prior ordinances of the City to the extent inconsistent with the terms hereof; and containing an emergency clause.  "}], "identifier": "BB 236", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=8904", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Terry Kennedy ", "person_id": "~{\"name\": \"Terry Kennedy \"}", "entity_type": "person", "organization_id": null, "primary": true}, {"classification": "co-sponsor", "name": "Lewis E Reed", "person_id": "~{\"name\": \"Lewis E Reed\"}", "entity_type": "person", "organization_id": null, "primary": false}], "versions": []}