{"classification": ["bill"], "extras": {}, "_id": "59a90852-7b68-11e5-8909-1040f380f686", "title": "Leasehold revenue refunding bonds", "related_bills": [], "legislative_session": "2010-2011", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-06-11", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-06-25", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-07-02", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-07-09", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 93  INTRODUCED BY: ALDERMAN STEPHEN CONWAY  An ordinance recommended by the Board of Estimate and Apportionment of the City of St. Louis, Missouri (the \"City\") authorizing and directing the issuance and sale by the St. Louis Municipal Finance Corporation (the \"Corporation\") of refunding bonds (the \"Refunding Bonds\") in order to refund a portion of the its Leasehold Revenue Refunding Bonds, Series 2003A (Civil Courts Building Project) (the \"Refunded Bonds\"), for the general welfare, safety, and benefit of the citizens of the City, which Refunding Bonds may be issued in an aggregate principal amount not to exceed $3,000,000, plus reasonable Costs of Issuance (as defined herein), redemption premium, if any, and costs of funding a debt service reserve fund, if any; authorizing and directing the officers of the City and/or the Corporation to execute and deliver, as necessary, an Indenture (as defined herein), a Base Lease (as defined herein), a Lease Purchase Agreement (as defined herein), a Deed of Trust (as defined herein), a Tax Compliance Agreement (as defined herein), a Continuing Disclosure Agreement (as defined herein), an Official Statement (as defined herein), a Bond Purchase Agreement (as defined herein), and an Escrow Agreement (as defined herein); providing for a debt service reserve fund, if any, for the Refunding Bonds; authorizing the Corporation, to obtain credit enhancement for all or any portion of the Refunding Bonds from one or more Credit Providers (as defined herein); authorizing the payment of any obligations due to such Credit Provider or Credit Providers, if any; authorizing and directing the officers of the Corporation to execute and deliver, as necessary, one or more Credit Agreements (as defined herein) and other documents related thereto, if any; authorizing participation of appropriate City officials in preparing an Official Statement; authorizing the acceptance of the terms of the Bond Purchase Agreement and the taking of further actions with respect thereto; authorizing the payment of certain Costs of Issuance; authorizing and directing the taking of other actions and approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof; superseding provisions of prior ordinances of the City to the extent inconsistent with the terms hereof; and containing an emergency clause.    "}], "identifier": "BB 93", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=6264", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Stephen Conway ", "person_id": "~{\"name\": \"Stephen Conway \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}