{"classification": ["bill"], "extras": {}, "_id": "761e5780-7b60-11e5-a5f6-1040f380f686", "title": "License tax on the operation of public garages", "related_bills": [], "legislative_session": "2015-2016", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-05-08", "description": "reading-1", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. \t53\tINTRODUCED BY ALDERWOMAN DONNA BARINGER, ALDERMAN KENNETH ORTMANN An ordinance relating to the license tax on the operation of public garages, imposed pursuant to SECTION FOUR of Ordinance 48891; repealing, subject to the approval of the qualified voters, SECTION FOUR of Ordinance 48891, approved June 11, 1958, as codified in Section 8.76. 040 of the Revised Code of the City of St. Louis, and enacting in lieu thereof a new SECTION FOUR imposing an increased license tax on the gross receipts of public garages, as defined in SECTION ONE of Ordinance 48891; directing that the revenue generated pursuant to the increase in the license tax on the operation of public garages be deposited in the Crime Reduction and Professional Policing Fund; repealing, subject to the approval of the qualified voters, Section 157.045 of SECTION ONE of Ordinance 56778, approved June 27, 1974, as codified in Section 8.76.050 of the Revised Code of the City of St. Louis; submitting to the qualified voters of the City of St. Louis a proposition to approve the increase in the license tax on the operation of public garages; providing for an election and the manner of voting thereat; providing that if such question shall receive the votes of a majority of the voters voting thereon that such tax as set forth within such proposition shall be authorized and adopted and become part of the laws of the City of St. Louis from the date of said election; and containing a severability clause and an emergency clause. "}], "identifier": "BB 53", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9876", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Donna Baringer ", "person_id": "~{\"name\": \"Donna Baringer \"}", "entity_type": "person", "organization_id": null, "primary": true}, {"classification": "co-sponsor", "name": "Kenneth Ortmann", "person_id": "~{\"name\": \"Kenneth Ortmann\"}", "entity_type": "person", "organization_id": null, "primary": false}], "versions": []}