{"classification": ["bill"], "extras": {}, "_id": "1d6d0236-7b62-11e5-bdbc-1040f380f686", "title": "Northpark partners land sale", "related_bills": [], "legislative_session": "2014-2015", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-10-03", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-10-24", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-10-31", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-11-07", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL #   148\t INTRODUCED BY ALDERMAN STEPHEN CONWAY An ordinance recommended by the Airport Commission, the Board of Public Service, and the Board of Estimate and Apportionment authorizing and directing the Director of Airports and the Comptroller of the City of St. Louis (\"St. Louis\") to enter into and execute on behalf of St. Louis an Agreement and Contract of Sale (\"Agreement\") substantially in the form as set out in ATTACHMENT \"1\" to this Ordinance, which is attached hereto and incorporated herein, between St. Louis, the owner and operator of Lambert-St. Louis International Airport® (\"Airport\"), which is located in St. Louis County, Missouri, and NorthPark Partners, LLC, a Missouri corporation (\"NorthPark\"), providing for the sale of approximately 6.475 acres of property owned by St. Louis and located in St. Louis County (\"St. Louis Property\"), which is more fully described in Section 1.A of the Agreement and Exhibit \"A\" thereto entitled \"Legal Description of St. Louis Property\", for the sum of Two Hundred Twenty Five Thousand Dollars ($225,000), and providing for the purchase of approximately 0.35 acres of property owned by NorthPark and located in St. Louis County (the \"NorthPark Property\"), which is more fully described in Section 1.B of the Agreement and Exhibit \"B\" thereto entitled \"Legal Description of NorthPark Property\", for the sum of Seventeen Thousand Seven Hundred Dollars ($17,700), subject to and in accordance with its provisions, and to the applicable rules and regulations of the Federal Aviation Administration (\"FAA\") and the applicable provision of the Airport's Amended and Restated Indenture of Trust between UMB Bank, N.A., Trustee, dated October 15, 1984 as amended, and Restated on September 10, 1997 as amended; authorizing and directing the Mayor and the Comptroller of St. Louis to enter into and execute on behalf of St. Louis the quit claim deed substantially in the form as set out in Exhibit \"D\" to the Agreement entitled \"Form of Quit Claim Deed for St. Louis Property\", remising, releasing, conveying, and forever quit-claiming unto NorthPark, its successors in interest and assigns, the St. Louis Property subject to the easement and restrictive covenants as defined and provided for in said quit claim deed; authorizing and directing the Mayor and the Comptroller of St. Louis to enter into and execute on behalf of St. Louis, a quit claim deed substantially in the form as set out in Exhibit \"E\" to the Agreement entitled \"Form of Quit Claim Deed for NorthPark Property\", remising, releasing, conveying, and forever quit-claiming unto St. Louis, its successors in interest, and assigns the NorthPark Property; authorizing and directing the Mayor and the Comptroller of St. Louis to enter into and execute on behalf of St. Louis an \"Easement Agreement\", substantially in the form as set out in Exhibit \"C\" to the Agreement entitled \"Form of Easement Agreement\", whereby St. Louis is granting to NorthPark a non-exclusive easement on certain property owned by St. Louis and more fully described in the Easement Agreement for the purpose of installing, maintaining, repairing and operating  a  storm water detention basin management system or facility, subject to the provisions of the Easement Agreement; authorizing the Mayor, the Comptroller, the Register, the City Counselor, the Director of Airports, and other appropriate officers, agents, and employees of St. Louis, with the advice of the Director of Airports, to enter into and execute on behalf of St. Louis and in St. Louis' best interest any attendant or related documents, agreements, permits, amendments, affidavits, certifications, or instruments deemed necessary to effectuate the terms set forth in the Agreement, and/or deemed necessary to preserve and protect St. Louis' interest, and/or to take such actions as may be necessary or appropriate in connection with the consummation of the transactions contemplated herein; providing that the provisions set forth in this Ordinance will be applicable exclusively to the agreements, documents, permits, and instruments approved and/or authorized by this Ordinance; and containing a severability clause and an emergency clause. "}], "identifier": "BB 148", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9489", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Stephen Conway ", "person_id": "~{\"name\": \"Stephen Conway \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}