{"classification": ["bill"], "extras": {}, "_id": "041e2ea2-7b66-11e5-939e-1040f380f686", "title": "Airport Revenue Refunding Bonds", "related_bills": [], "legislative_session": "2012-2013", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-01-11", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-01-18", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-01-25", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-02-01", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL #262     INTRODUCED BY ALDERMAN TERRY KENNEDY An ordinance authorizing and directing the issuance by The City of St. Louis, Missouri, of its Airport Revenue Refunding Bonds, Series 2013 (Non-AMT), Lambert-St. Louis International Airport, in an aggregate principal amount not to exceed Thirty-Seven Million Five Hundred Thousand Dollars ($37,500,000) (the \"Series 2013 Bonds\") in one or more series to effect the refunding of all or a portion of the City's outstanding Airport Revenue Refunding Bonds, Series 2003A (Non-AMT), Lambert-St. Louis International Airport (the \"Series 2003A Bonds\"); providing for the funding of any required reserve funds and for the payment of costs of issuance and other related transaction costs with respect to the issuance of the Series 2013 Bonds; setting forth terms and conditions for the issuance of the Series 2013 Bonds; appointing a trustee, a bond registrar and a paying agent in connection with the Series 2013 Bonds; appointing an escrow agent in connection with the outstanding Series 2003A Bonds to be refunded with the proceeds of the Series 2013 Bonds; approving the form and authorizing the execution and delivery of the Nineteenth Supplemental Indenture of Trust with respect to the issuance of the Series 2013 Bonds including any conforming or clarifying amendments to the Amended and Restated Indenture of Trust, as amended and supplemented, of the City; authorizing the negotiated sale of the Series 2013 Bonds and the execution and delivery of a Bond Purchase Agreement, an Escrow Agreement, if any, and other matters with respect thereto; authorizing the preparation, execution and distribution of the Preliminary Official Statement and the Official Statement and the preparation, execution and delivery of the Continuing Disclosure Agreement; authorizing the negotiation and purchase of credit enhancement (including bond insurance, credit facilities, and sureties), if any, and any necessary related documents; authorizing the proper officials, agents and employees of the City to execute such documents and to take such actions as are necessary or appropriate in connection with the foregoing matters; repealing ordinances of the City to the extent inconsistent with the terms hereof; and containing a severability clause.  "}], "identifier": "BB 262", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=8302", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Terry Kennedy ", "person_id": "~{\"name\": \"Terry Kennedy \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}