{"classification": ["bill"], "extras": {}, "_id": "0787a6f6-7b62-11e5-bc50-1040f380f686", "title": "Redevelopment plan for 4449-73 Evans", "related_bills": [], "legislative_session": "2014-2015", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-09-12", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-07-11", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-09-26", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-10-03", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 130\t\tINTRODUCED BY ALDERMAN MOORE  \tAn ordinance approving an amended blighting study and redevelopment plan dated June 24, 2014 for the 4449-73 Evans Ave. Redevelopment Area (as further defined herein, the \"Amended Plan\") after affirming that the area blighted by Ordinance 68733 known as the 4457-73 Evans Ave. Redevelopment Area (\"Area\") as described in Attachment \"A-1\" incorporated herein by reference, was a blighted area as defined in Section 99.320 of the Revised Statutes of Missouri, 2000, as amended, (the \"Statute\" being Sections 99.300 to 99.715 RSMo inclusive as amended) as of January 1, 2009, and that all additional property contained in the amended Area as described in Attachment \"A\" (\"Amended Area\") was found to be blighted as of that date as defined in Section 99.320 RSMo, as amended, affirming and finding that redevelopment and rehabilitation of the Amended Area is in the interest of the public health, safety, morals and general welfare of the people of the City of St. Louis (\"City\"); approving the Amended Plan, incorporated herein by Attachment \"B\" pursuant to Section 99.430 RSMo, as amended for the Amended Area; affirming and finding that there is a feasible financial plan for the redevelopment of the Amended Area which affords maximum opportunity for redevelopment of the Amended Area by private enterprise; finding that no property in the Amended Area may be acquired by the Land Clearance for Redevelopment Authority of the City of St. Louis (\"LCRA\"), a public body corporate and politic created under Missouri law, through the exercise of eminent domain; finding that the property within the Amended Area is occupied, and the Redeveloper(s) (as defined herein) shall be responsible for providing relocation assistance pursuant to the Amended Plan to any eligible occupants displaced as a result of implementation of the Amended Plan; finding that financial aid may be necessary to enable the Amended Area to be redeveloped in accordance with the Amended Plan; finding that there shall be available up to ten (10) year real estate tax abatement; and pledging cooperation of the St. Louis Board of Aldermen (\"Board\") and requesting various officials, departments, boards and agencies of the City to cooperate and exercise their respective powers in a manner consistent with the Amended Plan; and containing a severability clause.    "}], "identifier": "BB 130", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9457", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Samuel L Moore ", "person_id": "~{\"name\": \"Samuel L Moore \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}