{"classification": ["bill"], "extras": {}, "_id": "4e9e2b5c-7b60-11e5-9860-1040f380f686", "title": "Redevelopment plan for 3836 Hartford, 3831 Wyoming", "related_bills": [], "legislative_session": "2015-2016", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-05-01", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-06-12", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-06-19", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-06-26", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO.  15\t\t\tINTRODUCED BY ALDERWOMAN MEGAN GREEN An ordinance approving a blighting study and redevelopment plan dated April 20, 2015 for the 3836 Hartford St. & 3831 Wyoming St. Redevelopment Area (as further defined herein, the \"Plan\") after finding that said Redevelopment Area (\"Area\") is blighted as defined in Section 99.320 of the Revised Statutes of Missouri, as amended (the \"Statute\" being Sections 99.300 to 99.715 RSMo inclusive, as amended); containing a description of the boundaries of the Area in the City of St. Louis (\"City\"), attached hereto and incorporated herein as Attachment \"A\", finding that redevelopment and rehabilitation of the Area is in the interest of the public health, safety, morals and general welfare of the people of the City; approving the Plan attached hereto and incorporated herein as Attachment \"B\", pursuant to Section 99.430 RSMo, as amended; finding that there is a feasible financial plan for the redevelopment of the Area which affords maximum opportunity for redevelopment of the Area by private enterprise; finding that no property in the Area may be acquired by the Land Clearance for Redevelopment Authority of the City of St. Louis (\"LCRA\"), a public body corporate and politic created under Missouri law, through the exercise of eminent domain; finding that no property within the Area is occupied, but if it shall become occupied, the Redeveloper (as defined herein) shall be responsible for providing relocation assistance pursuant to the Plan to any eligible occupants displaced as a result of implementation of the Plan; finding that financial aid may be necessary to enable the Area to be redeveloped in accordance with the Plan; finding that there shall be available up to a five (5) year real estate tax abatement; and pledging cooperation of this St. Louis Board of Aldermen (\"Board\") and requesting various officials, departments, boards and agencies of the City to cooperate and to exercise their respective powers in a manner consistent with the Plan; and containing a severability clause. "}], "identifier": "BB 15", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9833", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Megan E. Green ", "person_id": "~{\"name\": \"Megan E. Green \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}