{"classification": ["bill"], "extras": {}, "_id": "57fbbd94-7b64-11e5-a9d2-1040f380f686", "title": "Contract for Memorial Tabernacle", "related_bills": [], "legislative_session": "2013-2014", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-02-07", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-02-21", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-02-28", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-03-07", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO.  296   \t     INTRODUCED BY ALDERMAN STEPHEN CONWAY\t  \tAn ordinance recommended by the Airport Commission, the Board of Public Service, and the Board of Estimate and Apportionment authorizing and directing the Director of Airports and the Comptroller of the City of St. Louis, Missouri, a municipal corporation (\"St. Louis\"), to enter into and execute on behalf of St. Louis the \"Agreement and Contract of Sale\" (substantially in the form as set out in ATTACHMENT \"1\" which is incorporated herein), between St. Louis, the owner and operator of Lambert-St. Louis International Airport® (\"Airport\"), which is located in St. Louis County, Missouri, and Memorial Tabernacle Baptist Church To Preserve the Heritage and Legacy of the Family of Harrold, a not-for-profit Missouri corporation  (\"Buyer\"), necessary for the sale by St. Louis to Buyer of certain surplus property (the \"Property\") located within the City of Kinloch, St. Louis County, Missouri that is more fully described in Section 1 and EXHIBIT \"A\" of the Agreement and Contract of Sale, subject to and in accordance with its provisions and to the applicable rules and regulations of the Federal Aviation Administration (\"FAA\") and the applicable provisions of the Airport's Amended and Restated Indenture of Trust between UMB Bank, N.A., Trustee, dated October 15, 1984 as amended, and restated on September 10, 1997 as amended;  providing for the deposit of the proceeds from the Agreement and Contract of Sale; authorizing and directing the Mayor and the Comptroller of St. Louis to enter into and execute on behalf of St. Louis the \"Quit Claim Deed\" substantially in the form as set out in EXHIBIT \"B\" to the Agreement and Contract of Sale subject to and in accordance with the terms of the Agreement and Contract of Sale, remising, releasing and forever quit-claiming unto Buyer, their successors and assigns, the Property subject to the easement and restrictive covenants as defined and provided for in the Quit Claim Deed; conditioning the execution and delivery by St. Louis of the agreements, documents, and instruments contemplated in this Ordinance on the FAA's prior written approval of: a) the release and sale of the surplus Property to the Buyer, b)  the provisions of the Agreement and Contract of Sale including, without limitation, the \"Purchase Price\" of Twelve Thousand Five Hundred Dollars ($12,500), as defined and provided for in Section 2 of the Agreement and Contract of Sale, and c) any other related matter required to be submitted to and approved by the FAA; authorizing the Mayor, the Comptroller, the Register, the City Counselor, the Director of Airports, and other appropriate officers, officials, agents, designees, representatives, and employees of St. Louis, with the advice of the Director of Airports, to enter into and execute on behalf of St. Louis and in St. Louis' best interest any attendant or related documents, agreements, affidavits, certificates, or instruments deemed necessary to effectuate the terms set forth in the Agreement and Contract of Sale, the Quit Claim Deed, and/or deemed necessary to preserve and protect St. Louis' interest and to take such actions as are necessary or appropriate in connection with the sale of the Property or the consummation of the transactions contemplated herein; providing that the provisions set forth in this Ordinance shall be applicable exclusively to the agreements, documents, and instruments approved and/or authorized by this Ordinance, and containing a severability clause, and an emergency clause.    "}], "identifier": "BB 296", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9037", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Stephen Conway ", "person_id": "~{\"name\": \"Stephen Conway \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}