{"classification": ["bill"], "extras": {}, "_id": "02d9be7e-7b66-11e5-891a-1040f380f686", "title": "Ground transportation ordinance", "related_bills": [], "legislative_session": "2012-2013", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-01-11", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-01-18", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-01-25", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2013-02-01", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO.   261\t\tINTRODUCED BY ALDERMAN TERRY KENNEDY  An Ordinance recommended by the Airport Commission and the Board of Estimate and Apportionment repealing certain ordinances pertaining to the regulation of and schedule of fees and charges for ground transportation operators at Lambert-St. Louis International Airport (the Airport\"), to wit: Ordinance 64406, approved July 1, 1998, Ordinance 65492, approved July 15, 2003 and Ordinance 66855, approved October 3, 2005; and enacting a new ordinance having the same subject matter:  (i)  containing a definitions section;  (ii) authorizing the Airport Director to issue regulations governing the conduct of ground transportation operators at the Airport, to enter into, execute, issue and amend Airport ground transportation use agreements (\"Permits\") and renew Permits to ground transportation operators, and to establish procedures for determining adjusted gross receipts; (iii) requiring any ground transportation operator to secure a Permit to use designated areas at the Airport to conduct its business; (iv) establishing a schedule of fees and charges which must be paid by ground transportation operators to conduct business at the Airport; (v) establishing a schedule of fees and charges which must be paid by ground transportation operators at the Airport as a condition precedent to the rights granted to the operator under the Permit; (vi) prohibiting solicitation by ground transportation operators, off-Airport rental car operators and off-Airport parking operators; (vii) providing for the filing by ground transportation operators of certain reports with the Airport Director and for the auditing of the reports; and (viii) providing for denial, suspension or revocation of a Permit for cause and a procedure for appealing the denial, suspension or revocation; containing a severability clause; and containing an emergency clause.   "}], "identifier": "BB 261", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=8301", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Terry Kennedy ", "person_id": "~{\"name\": \"Terry Kennedy \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}