{"classification": ["bill"], "extras": {}, "_id": "6a09f4ee-7b62-11e5-933a-1040f380f686", "title": "Series 2015 Kiel Refunding Project", "related_bills": [], "legislative_session": "2014-2015", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-12-05", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-12-12", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-01-09", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-01-16", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 216         INTRODUCED BY ALDERMAN TERRY KENNEDY An ordinance recommended by the Board of Estimate and Apportionment pertaining to, and providing for the issuance of obligations payable under an annually renewable lease agreement, authorizing and directing the execution and delivery, in one or more series, of lease certificates of participation obligations of the City of St. Louis, Missouri (the \"City\"), evidencing interests in the right to receive rentals to be made by the City pursuant to an annually renewable lease agreement (the \"Series 2015 Obligations\") in an aggregate principal amount of not to exceed $5,500,000 in order to refinance and refund all or a portion of the St. Louis Municipal Finance Corporation Lease Certificates of Participation (City of St. Louis, Missouri, Lessee) Series 2008 (the \"Series 2008 Obligations\") outstanding in the principal amount of $5,455,000 (the \"Refunded Bonds\"), funding a debt service reserve account and paying costs of issuance of the Series 2015 Obligations including credit enhancement fees, if any, all for the general welfare, safety and benefit of the citizens of the City; authorizing the creation of and continuation of a lien and security interest by the Corporation in a leasehold interest in the premises leased  (\"Leased Premises\") under a Supplemental Lease Agreement between the City and the Corporation, to secure payment of the Series 2015 Obligations and/or to secure payment of obligations due to the Credit Provider (as hereafter defined), if any, authorizing and directing the officers of the Corporation to execute and deliver the Supplemental Indenture of Trust, the Supplemental Lease Agreement, the Official Statement, the Purchase Agreement, the Continuing Disclosure Agreement and the Escrow Agreement; authorizing the obtaining of credit enhancement, if any, for the Series 2015 Obligations from a Credit Provider (as defined below), authorizing the payment of any obligations due to a Credit Provider, if any, and authorizing the Comptroller and any other appropriate City officials, if necessary, to execute any Credit Agreement, as defined below, or other documents related thereto; authorizing the execution of an annually renewable lease agreement between the City and the St. Louis Municipal Finance Corporation (the \"Corporation\"); authorizing participation of appropriate City officials in preparing the preliminary Official Statement and final Official Statement for the Series 2015 Obligations, and the acceptance of the terms of a Purchase Agreement for the Series 2015 Obligations and the taking of further actions with respect thereto; and authorizing and directing the taking of other actions, and approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof; and containing a severability clause. "}], "identifier": "BB 216", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9616", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Terry Kennedy ", "person_id": "~{\"name\": \"Terry Kennedy \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}