{"classification": ["bill"], "extras": {}, "_id": "b6cb22ba-7b66-11e5-ad24-1040f380f686", "title": "Justice Center Refunding Bonds", "related_bills": [], "legislative_session": "2011-2012", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2011-06-10", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2011-06-17", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2011-06-24", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2011-06-24", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL #90\t    INTRODUCED BY ALDERWOMAN APRIL FORD-GRIFFIN    An ordinance recommended by the Board of Estimate and Apportionment authorizing and directing the St. Louis Municipal Finance Corporation (the ?Corporation?) to issue and sell one or more series of the Corporation?s City Justice Center Leasehold Revenue Refunding Bonds, Series 2011 (City of St. Louis, Missouri, Lessee) (the ?Series 2011 Bonds?) in an aggregate principal amount not to exceed $70,000,000 in order to refund or redeem, if desirable, all or a portion of its City Justice Center Leasehold Revenue Refunding Bonds, Series 2001A (City of St. Louis, Missouri, Lessee), dated as of September 1, 2001 (the ?Series 2001A Bonds?), all or a portion of its City Justice Center Leasehold Refunding Revenue Bonds, Series 2005 (City of St. Louis, Missouri, Lessee), dated as of September 1, 2005 (the ?Series 2005 Bonds?), and/or all or a portion of its City Justice Center Leasehold Revenue Refunding Bonds, Series 2009 (City of St. Louis, Missouri, Lessee), dated as of October 13, 2009 (the ?Series 2009 Bonds?), for the general welfare, safety and benefit of the citizens of The City of St. Louis, Missouri (the ?City?); authorizing and directing the Corporation to execute and deliver the Sixth Supplemental Indenture of Trust, the Fourth Supplemental Base Lease, if any, the Fifth Supplemental Lease Agreement, if any, the Credit Agreement, if any, the Escrow Agreement, if any, the Tax Compliance Agreement, the Bond Purchase Agreement, and the Official Statement; authorizing the City to execute the Fourth Supplemental Base Lease, if any, the Fifth Supplemental Lease Agreement, if any, the Second Supplemental Pledge Agreement, if any, the Credit Agreement, if any, the Escrow Agreement, if any, the Continuing Disclosure Agreement, the Tax Compliance Agreement, the Bond Purchase Agreement, and the Official Statement; authorizing the Corporation and the City to obtain credit enhancement for the Series 2011 Bonds from a Credit Provider, authorizing the payment of any obligations due to a Credit Provider, if any, and authorizing the Comptroller and any other appropriate City officials to execute the Credit Agreement and other documents related thereto, if any; authorizing participation of appropriate City officials in preparing the Official Statement; authorizing the acceptance of the terms of the Bond Purchase Agreement and the taking of further actions with respect thereto; authorizing the payment of certain costs of issuance thereof; authorizing and directing the taking of other actions and approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof; and superseding provisions of prior ordinances of the City to the extent inconsistent with the terms hereof.    "}], "identifier": "BB 90", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=7152", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "April Ford-Griffin ", "person_id": "~{\"name\": \"April Ford-Griffin \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}