{"classification": ["bill"], "extras": {}, "_id": "682ed8f8-7b62-11e5-9f05-1040f380f686", "title": "Forest Park Leasehold Revenue Refunding Bonds", "related_bills": [], "legislative_session": "2014-2015", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-12-05", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2014-12-12", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-01-09", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-01-16", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL #215       \tINTRODUCED BY ALDERMAN TERRY  KENNEDY An Ordinance recommended by the Board of Estimate and Apportionment authorizing and directing the St. Louis Municipal Finance Corporation (the \"Corporation\") to issue and sell its Forest Park Leasehold Revenue Refunding Bonds (City of St. Louis, Missouri, Lessee), Series 2015, in an aggregate principal amount not to exceed $11,000,000 (the \"Series 2015 Bonds\") in order to refund all or a portion of its outstanding Leasehold Revenue Refunding Bonds (City of St. Louis, Missouri, Lessee), Series 2004 (the \"Series 2004 Bonds\"), all for the general welfare, safety and benefit of the citizens of The City of St. Louis, Missouri (the \"City\"); authorizing and directing the Corporation to execute and deliver the Fourth Supplemental Indenture of Trust, any necessary supplement or amendment to the Base Lease or the Lease Purchase Agreement relating to the Leased Property, the Tax Compliance Agreement, the Official Statement, the Bond Purchase Agreement, the Continuing Disclosure Agreement, the Escrow Agreement, if any, and the Credit Agreement, if any (all as defined herein); authorizing the City to execute any supplement or amendment to the Base Lease or the Lease Purchase Agreement, the Continuing Disclosure Agreement, the Tax Compliance Agreement, the Official Statement, the Bond Purchase Agreement, and the Credit Agreement, if any (all as defined herein); authorizing the Corporation to obtain credit enhancement for the Series 2015 Bonds from a Credit Provider (as defined herein); authorizing the payment of any obligations due to a Credit Provider, if any, and authorizing the Comptroller, and any other appropriate City officials to execute the Credit Agreement and other documents related thereto, if any; authorizing participation of appropriate City officials in preparing the Official Statement; authorizing the acceptance of the terms of the Bond Purchase Agreement and the taking of further actions with respect thereto; authorizing the payment of certain costs of issuance of the Series 2015 Bonds; authorizing and directing the taking of other actions and approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof; superseding provisions of prior ordinances of the City to the extent inconsistent with the terms hereof; and containing an emergency clause. "}], "identifier": "BB 215", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=9615", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Terry Kennedy ", "person_id": "~{\"name\": \"Terry Kennedy \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}