{"classification": ["bill"], "extras": {}, "_id": "64859aec-7b68-11e5-be2c-1040f380f686", "title": "Water rev. tax exempt bonds", "related_bills": [], "legislative_session": "2010-2011", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-06-11", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-06-18", "description": "reading-2", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 101\t\tINTRODUCED BY ALDERMAN MATT VILLA    An ordinance authorizing and directing the issuance in the name of The City of St. Louis (the \"City\") of its Water Revenue Tax-Exempt Refunding Bonds, Series 2010 and/or its Water Revenue Tax Exempt Bonds and/or Taxable Build America Bonds (together with the Water Revenue Tax-Exempt Refunding Bonds, the \"Series 2010 Bonds\"), in an aggregate principal amount not to exceed $50,000,000 for the purpose of refunding the City's Water Revenue Refunding Bonds, Series 1998 and/or purchasing, constructing, extending and improving the waterworks system owned by the City; setting forth certain terms and conditions for said Bonds; granting authority to the Treasurer of the City to employ a trustee, paying agent, and/or escrow agent in connection with such bonds; approving the form and authorizing the execution and delivery of the Third Supplemental Indenture of Trust (the \"Indenture\"); authorizing the negotiated sale of the Bonds and the execution and delivery of a Bond Purchase Agreement; authorizing the taking of other action, approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof and to comply with the duties of the City under any agreement for credit enhancement, if any; authorizing the transfer of waterworks system revenues to the accounts and sub-accounts established under the Indenture; authorizing the taking of other actions and the execution other documents as necessary or desirable in furtherance of the purpose hereof; and containing severability and emergency clauses.      "}], "identifier": "BB 101", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=6272", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Matt Villa ", "person_id": "~{\"name\": \"Matt Villa \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}