{"classification": ["bill"], "extras": {}, "_id": "5b4c5876-7b61-11e5-8858-1040f380f686", "title": "Bond Reduction", "related_bills": [], "legislative_session": "2015-2016", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-10-16", "description": "reading-1", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO.203\tINTRODUCED BY ALDERMAN CARTER AN ORDINANCE RECOMMENDED BY THE PARKING COMMISSION OF THE CITY OF ST. LOUIS AND AUTHORIZING AND DIRECTING THE CITY, ACTING THROUGH THE TREASURER OF THE CITY IN HER CAPACITY AS SUPERVISOR OF PARKING METERS, TO ISSUE PARKING REVENUE BONDS, SERIES 2015B (TAX-EXEMPT), IN AN AGGREGATE PRINCIPAL AMOUNT NOT TO EXCEED $48,000,000; SETTING FORTH CERTAIN TERMS AND CONDITIONS RELATIVE TO SUCH BONDS; APPOINTING A TRUSTEE, BOND REGISTRAR AND PAYING AGENT IN CONNECTION WITH THE BONDS; APPROVING AND AUTHORIZING THE EXECUTION OF A SUPPLEMENTAL TRUST INDENTURE NO. 5, AN ESCROW AGREEMENT, A CONTINUING DISCLOSURE AGREEMENT AND A TAX COMPLIANCE AGREEMENT; AUTHORIZING THE NEGOTIATED SALE OF THE BONDS AND THE EXECUTION AND DELIVERY OF A BOND PURCHASE AGREEMENT; AUTHORIZING THE PREPARATION AND DISTRIBUTION OF THE PRELIMINARY OFFICIAL STATEMENT AND THE PREPARATION, EXECUTION AND DISTRIBUTION OF THE OFFICIAL STATEMENT RESPECTING THE BONDS AND THE TAKING OF FURTHER ACTIONS WITH RESPECT THERETO; THE TAKING OF OTHER ACTIONS, AND THE EXECUTION AND APPROVAL OF OTHER DOCUMENTS (EXHIBIT 1), AS ARE NECESSARY OR DESIRABLE TO CARRY OUT AND COMPLY WITH THE INTENT HEREOF AND TO COMPLY WITH THE DUTIES OF THE CITY UNDER ANY AGREEMENT FOR BOND INSURANCE; AUTHORIZING THE REIMBURSEMENT OF CERTAIN AMOUNTS PREVIOUSLY EXPENDED ON THE ISSUANCE OF THE SERIES 2015B BONDS AND THE REFUNDING OF THE REFUNDED BONDS AND CONTAINING A SEVERABILITY CLAUSE. "}], "identifier": "BB 203", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=10313", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Chris Carter            ", "person_id": "~{\"name\": \"Chris Carter            \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}