{"classification": ["bill"], "extras": {}, "_id": "503fb238-7b61-11e5-aa7e-1040f380f686", "title": "Trans funds emergency repair and replacement", "related_bills": [], "legislative_session": "2015-2016", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2015-10-16", "description": "reading-1", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL  196  INTRODUCED BY ALDERWOMAN LYDA KREWSON An ordinance recommended and approved by the Airport Commission, the Comptroller and the Board of Estimate and Apportionment, making certain findings with respect to the transfer in an amount not to exceed Four Hundred Thousand Dollars ($400,000) of excess moneys that The City of St. Louis (the \"City\"), the owner and operator of Lambert-St. Louis International Airport® (the \"Airport\"), intends to transfer from the Debt Service Stabilization Fund (the \"DSSF\") to the \"Airport Development Fund\" in accordance with Section 516.B of the Lambert-St. Louis International Airport Indenture of Trust between the City, as Grantor, and UMB Bank, N.A., as Trustee, dated as of October 15, 1984, as amended and restated as of July 1, 2009, as amended and supplemented (the \"Indenture\"); authorizing a transfer in an amount not to exceed Four Hundred Thousand Dollars ($400,000) from the DSSF into the Airport Development Fund during the fiscal year beginning July 1, 2015, for the purpose of making funds available to make certain emergency replacements and repairs to Airport buildings, terminals, structures, equipment, and environs and other associated Airport drainage systems which due to their age, condition and design are causing flooding in Airport buildings, terminals and surrounding areas during periods of heavy precipitation, more fully described in EXHIBIT A entitled \"Emergency Repair & Replacement Project\" that is incorporated herein; containing a severability clause; and containing an emergency clause. "}], "identifier": "BB 196", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=10306", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Lyda Krewson            ", "person_id": "~{\"name\": \"Lyda Krewson            \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}