{"classification": ["bill"], "extras": {}, "_id": "e14451e6-7b67-11e5-ae07-1040f380f686", "title": "Justice Center - DSRF", "related_bills": [], "legislative_session": "2010-2011", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-04-30", "description": "reading-1", "related_entities": []}, {"classification": ["reading-2"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-05-14", "description": "reading-2", "related_entities": []}, {"classification": ["committee-referral"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-05-21", "description": "committee-referral", "related_entities": []}, {"classification": ["reading-3"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-05-28", "description": "reading-3", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL #6  INTRODUCED BY: ALDERMAN STEPHEN CONWAY    An ordinance recommended by the Board of Estimate and Apportionment authorizing and directing the Comptroller of The City of St. Louis, Missouri (the ?City?) to renew a credit facility (the ?Bank of America Credit Facility?) previously obtained for the purpose of securing the outstanding City Justice Center Bonds (as defined herein), for the general welfare, safety, and benefit of the citizens of the City; authorizing the City to execute and deliver a first amended and restated promissory note (the ?Restated Note?) payable to Bank of America, N.A. (the ?Bank?) pursuant to which the Bank will renew the Bank of America Credit Facility; authorizing the payment of certain obligations due to the Bank under the Restated Note; authorizing the Mayor, the Comptroller, and any other appropriate City officials, if necessary, to execute any other documents related to the Restated Note and the Bank of America Credit Facility; authorizing and directing the Comptroller of the City to obtain a credit facility (the ?Northern Trust Credit Facility?) to be issued by The Northern Trust Company (?Northern Trust?) for the purpose of replacing the Bank of America Credit Facility upon its termination and securing the outstanding City Justice Center Bonds, for the general welfare, safety, and benefit of the citizens of the City; authorizing and directing the St. Louis Municipal Finance Corporation (the ?Corporation?) to execute and deliver a supplemental indenture, if any, amending the herein described Indenture and a supplemental lease purchase agreement, if any, amending the herein described Lease Agreement in connection with the Northern Trust Credit Facility; authorizing the City to execute and deliver such supplemental lease purchase agreement, if any, and an agreement with Northern Trust (the ?Northern Trust Agreement?) pursuant to which the Northern Trust Credit Facility shall be issued; authorizing the payment of certain obligations due to the Bank under the Northern Trust Agreement;  authorizing the Mayor, the Comptroller, and any other appropriate City officials, if necessary, to execute any other documents related to the Northern Trust Credit Facility; authorizing and directing the taking of other actions and approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof; and containing an emergency clause.  "}], "identifier": "BB 6", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=6083", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Stephen Conway ", "person_id": "~{\"name\": \"Stephen Conway \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}