{"classification": ["bill"], "extras": {}, "_id": "b723fcee-7b68-11e5-bef1-1040f380f686", "title": "G.O. Bonds defeasance", "related_bills": [], "legislative_session": "2010-2011", "other_identifiers": [], "other_titles": [], "actions": [{"classification": ["reading-1"], "organization_id": "~{\"classification\": \"legislature\"}", "date": "2010-10-01", "description": "reading-1", "related_entities": []}], "subject": [], "abstracts": [{"date": "", "note": "summary", "abstract": "BOARD BILL NO. 159  INTRODUCED BY: ALDERMAN STEPHEN CONWAY    An ordinance of the City of St. Louis, Missouri (the \"City\") authorizing and directing the defeasance of all or any portion of the General Obligation Refunding Bonds, Series 2005, issued by the City in the initial aggregate principal amount of $37,555,000 (the \"Series 2005 Bonds\") and/or the General Obligation Bonds, Series 2006, issued by the City in the initial aggregate principal amount of $13,000,000 (the \"Series 2006 Bonds\") for the general welfare, safety, and benefit of the citizens of the City; making an appropriation from the General Fund to the Fund 1311, Center 1602005, to be used for payment of principal of, and interest and premium, if any, on any portion of the Series 2005 Bonds defeased as authorized hereunder and other costs associated with the defeasance of said Series 2005 Bonds and making an appropriation from the General Fund to Fund 1311, Center 1602006, to be used for payment of principal of, and interest and premium, if any, on any portion of the Series 2006 Bonds defeased as authorized hereunder and other costs associated with the defeasance of said Series 2006 Bonds; authorizing and directing the officers of the City to execute and deliver, as necessary, an Escrow Deposit Agreement (as defined herein); authorizing and directing the conducting of a competitive procurement process for open market securities and/or the filing of a subscription for State and Local Government Securities; authorizing the selection of a financial advisor, structuring agent, bond counsel, escrow agent, and verification agent in connection with the defeasance of all or any portion of the Series 2005 Bonds and/or the Series 2006 Bonds; authorizing and directing the taking of other actions and approval and execution of other documents as necessary or desirable to carry out and comply with the intent hereof; and superseding provisions of prior ordinances of the City to the extent inconsistent with the terms hereof.  "}], "identifier": "BB 159", "from_organization": "~{\"classification\": \"legislature\"}", "documents": [], "sources": [{"url": "https://www.stlouis-mo.gov/government/departments/aldermen/city-laws/board-bills.cfm?bbDetail=true&BBId=6505", "note": "detail"}], "sponsorships": [{"classification": "Primary", "name": "Stephen Conway ", "person_id": "~{\"name\": \"Stephen Conway \"}", "entity_type": "person", "organization_id": null, "primary": true}], "versions": []}